craftmetrics/esp32-homie/homie.c
/*
 *   MIT License
 *
 *   Copyright (c) 2018 Craft Metrics Inc.
 *
 *   Permission is hereby granted, free of charge, to any person obtaining a copy
 *   of this software and associated documentation files (the "Software"), to deal
 *   in the Software without restriction, including without limitation the rights
 *   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *   copies of the Software, and to permit persons to whom the Software is
 *   furnished to do so, subject to the following conditions:
 *
 *   The above copyright notice and this permission notice shall be included in all
 *   copies or substantial portions of the Software.
 *
 *   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *   FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *   LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *   OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 *   SOFTWARE.
 */

#include <stdarg.h>
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"

#if defined(ESP_IDF_VERSION_MAJOR) // defined in esp-idf 4.x, but not 3.x
#define HOMIE_IDF_VERSION4
#else
#define HOMIE_IDF_VERSION3
#endif

#include <esp_log.h>
#include <esp_system.h>
#include <esp_wifi.h>
#include <esp_ota_ops.h>
#if defined(HOMIE_IDF_VERSION4)
#include <esp_event.h>
#else
#include <esp_event_loop.h>
#endif

#include "homie.h"

#if defined(HOMIE_IDF_VERSION4)
#include "task_ota.h"
#else
#include "ota.h"
#endif

#define QOS_0 (0)
#define QOS_1 (1)
#define QOS_2 (2)
#define RETAINED (1)
#define NOT_RETAINED (0)

#if defined(CONFIG_IDF_TARGET_ESP32S2BETA)
#define CHIP_NAME "ESP32-S2 Beta"
#else
#define CHIP_NAME "ESP32"
#endif

#define FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(f) do { \
        if (f <= 0) { \
            goto fail; \
        } \
    } while (0)

static const char *TAG = "HOMIE";
static const char homie_node_name[] = "esp";
static esp_mqtt_client_handle_t client;
static homie_config_t *config;
static EventGroupHandle_t *mqtt_group;

static esp_err_t homie_connected();

static bool _starts_with(const char *pre, const char *str, int lenstr)
{
    size_t lenpre = strlen(pre);
    return lenstr < lenpre ? false : strncmp(pre, str, lenpre) == 0;
}

#define REMOTE_LOGGING_MAX_PAYLOAD_LEN 1024
static int _homie_logger(const char *str, va_list l)
{
    int ret;
    char buf[REMOTE_LOGGING_MAX_PAYLOAD_LEN];

    ret = vsnprintf(buf, REMOTE_LOGGING_MAX_PAYLOAD_LEN, str, l);
    if (ret < 0 || ret >= sizeof(buf)) {
        ESP_LOGW(TAG, "_homie_logger(): too long");
    }
    if (homie_publish("log", QOS_1, NOT_RETAINED, buf) <= 0) {
        ESP_LOGW(TAG, "_homie_logger(): homie_publish() failed");
    }
    return vprintf(str, l);
}

static void homie_handle_mqtt_event(esp_mqtt_event_handle_t event)
{
    ESP_LOGD(TAG, "topic: %s length: %d data length: %d", event->topic, event->topic_len, event->data_len);

    // Check if it is reboot command
    char topic[HOMIE_MAX_TOPIC_LEN];
#if defined(CONFIG_HOMIE_VERSION_2_0_1)
    ESP_ERROR_CHECK(homie_mktopic(topic, "$implementation/reboot"));
    if ((strncmp(topic, event->topic, event->topic_len) == 0) && (strncmp("true", event->data, event->data_len) == 0))
#elif defined(CONFIG_HOMIE_VERSION_4_0_0)
    ESP_ERROR_CHECK(homie_mktopic(topic, "esp/reboot/set"));
    if ((strncmp(topic, event->topic, event->topic_len) == 0) && (strncmp("reboot", event->data, event->data_len) == 0))
#else
#error "Homie version is not set"
#endif
    {
        if (config->reboot_enabled) {
            ESP_LOGI(TAG, "Rebooting...");
            esp_restart();
        }
        return;
    }

    // Check if it is enable remote console
    ESP_ERROR_CHECK(homie_mktopic(topic, "$implementation/logging"));
    if (strncmp(topic, event->topic, event->topic_len) == 0)
    {
        if (strncmp("true", event->data, event->data_len) == 0)
        {
            ESP_LOGI(TAG, "Enable remote logging");
            esp_log_set_vprintf(_homie_logger);
            ESP_LOGI(TAG, "Remote logging enabled");
        }
        else
        {
            ESP_LOGI(TAG, "Disable remote logging");
            esp_log_set_vprintf(vprintf);
            ESP_LOGI(TAG, "Remote logging disabled");
        }
        return;
    }

    // Check if it is a OTA update
#if defined(CONFIG_HOMIE_VERSION_2_0_1)
    ESP_ERROR_CHECK(homie_mktopic(topic, "$implementation/ota/url"));
    if (_starts_with(topic, event->topic, event->topic_len) && strncmp("true", event->data, event->data_len) == 0)
#elif defined(CONFIG_HOMIE_VERSION_4_0_0)
    ESP_ERROR_CHECK(homie_mktopic(topic, "esp/ota/set"));
    if (_starts_with(topic, event->topic, event->topic_len) && strncmp("run", event->data, event->data_len) == 0)
#else
#error "Homie version is not set"
#endif
    {
        char *url = calloc(1, event->data_len + 1);
        strncpy(url, event->data, event->data_len);
        url[event->data_len] = '\0';
#if defined(HOMIE_IDF_VERSION4)
        do_ota(url, config->cert_pem);
#else
        ota_init(url, config->cert_pem, config->ota_status_handler);
#endif
        return;
    }

    // Call the application's handler
    ESP_ERROR_CHECK(homie_mktopic(topic, ""));
    if (config->msg_handler)
    {
        int subtopic_len = event->topic_len - strlen(topic);
        char *subtopic = calloc(1, subtopic_len + 1);
        strncpy(subtopic, event->topic + strlen(topic), subtopic_len);
        subtopic[subtopic_len] = '\0';

        char *payload = calloc(1, event->data_len + 1);
        strncpy(payload, event->data, event->data_len);
        payload[event->data_len] = '\0';

        config->msg_handler(subtopic, payload);

        free(subtopic);
        free(payload);
    }
}

static esp_err_t mqtt_event_handler_cb(esp_mqtt_event_handle_t event)
{
    switch (event->event_id)
    {
    case MQTT_EVENT_BEFORE_CONNECT:
        ESP_LOGI(TAG, "MQTT_EVENT_BEFORE_CONNECT");
        break;

    case MQTT_EVENT_CONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");
        xEventGroupSetBits(*mqtt_group, HOMIE_MQTT_CONNECTED_BIT);
        xEventGroupSetBits(*mqtt_group, HOMIE_MQTT_STATUS_UPDATE_REQUIRED);
        if (config->connected_handler != NULL)
            config->connected_handler();
        break;

