craftmetrics/esp32-homie/homie.c
    case MQTT_EVENT_DISCONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
        xEventGroupClearBits(*mqtt_group, HOMIE_MQTT_STATUS_UPDATE_REQUIRED);
        break;

    case MQTT_EVENT_SUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
        break;

    case MQTT_EVENT_UNSUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
        break;

    case MQTT_EVENT_PUBLISHED:
        // Disabled to avoid triggering circular events with remote logging
        //ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
        break;

    case MQTT_EVENT_DATA:
        ESP_LOGI(TAG, "MQTT_EVENT_DATA");
        homie_handle_mqtt_event(event);
        break;

    case MQTT_EVENT_ERROR:
        ESP_LOGI(TAG, "MQTT_EVENT_ERROR");
        break;
    }
    return ESP_OK;
}

#if defined(HOMIE_IDF_VERSION4)
static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
    ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%d", base, event_id);
    mqtt_event_handler_cb(event_data);
}
#endif

static esp_mqtt_client_handle_t mqtt_app_start(void)
{
    char *lwt_topic = calloc(1, HOMIE_MAX_TOPIC_LEN);
    esp_err_t err;

    ESP_LOGI(TAG, "URI: `%s`", config->mqtt_uri);
    ESP_LOGI(TAG, "client_id: `%s`", config->client_id);
    ESP_LOGI(TAG, "user name: `%s`", config->mqtt_username);
    ESP_LOGI(TAG, "base_topic: `%s`", config->base_topic);
    ESP_LOGI(TAG, "stack_size: %d", config->stack_size);

    ESP_ERROR_CHECK(homie_mktopic(lwt_topic, "$online"));

    esp_mqtt_client_config_t mqtt_cfg = {
        .client_id = config->client_id,
        .uri = config->mqtt_uri,
        .username = config->mqtt_username,
        .password = config->mqtt_password,
#if defined(HOMIE_IDF_VERSION3)
        .event_handle = mqtt_event_handler_cb,
#endif
        .lwt_msg = "false",
        .lwt_retain = 1,
        .lwt_topic = lwt_topic,
        .keepalive = 15,
        .cert_pem = config->cert_pem,
        .task_stack = config->stack_size,
    };

    if ((client = esp_mqtt_client_init(&mqtt_cfg)) == NULL) {
        ESP_LOGE(TAG, "esp_mqtt_client_init() failed");
        goto fail;
    }
#if defined(HOMIE_IDF_VERSION4)
    esp_mqtt_client_register_event(client, ESP_EVENT_ANY_ID, mqtt_event_handler, client);
#endif
    if ((err = esp_mqtt_client_start(client)) != ESP_OK) {
        ESP_LOGE(TAG, "esp_mqtt_client_start(): %s", esp_err_to_name(err));
        goto fail;
    }
    return client;
fail:
    return NULL;
}

esp_err_t homie_mktopic(char *topic, const char *subtopic)
{
    int ret = snprintf(topic, HOMIE_MAX_TOPIC_LEN, "%s/%s/%s",
            config->base_topic, config->client_id, subtopic);

    if (ret < 0 || ret >= HOMIE_MAX_TOPIC_LEN) {
        ESP_LOGE(TAG, "homie_mktopic(): MQTT topic length is too long: ret: %d, HOMIE_MAX_TOPIC_LEN %d",
                ret, HOMIE_MAX_TOPIC_LEN);
        goto fail;
    }
    return ESP_OK;
fail:
    return ESP_FAIL;
}

int homie_subscribe(const char *subtopic)
{
    int msg_id;
    char topic[HOMIE_MAX_TOPIC_LEN];
    ESP_ERROR_CHECK(homie_mktopic(topic, subtopic));

    msg_id = esp_mqtt_client_subscribe(client, topic, 0);
    if (msg_id < 0) {
        ESP_LOGW(TAG, "esp_mqtt_client_subscribe() failed: topic: `%s`", topic);
        goto fail;
    }
    ESP_LOGI(TAG, "sent subscribe successful, topic: `%s` msg_id=%d", topic, msg_id);
    return msg_id;
fail:
    return -1;
}

int homie_publish(const char *subtopic, int qos, int retain, const char *payload)
{
    int msg_id = -1;
    char topic[HOMIE_MAX_TOPIC_LEN];
    if (homie_mktopic(topic, subtopic) != ESP_OK) {
        ESP_LOGW(TAG, "homie_mktopic() failed");
        goto fail;
    }
    ESP_LOGD(TAG, "%s\n", topic);
    msg_id = esp_mqtt_client_publish(client, topic, payload, 0, qos, retain);
fail:
    return msg_id;
}

int homie_publishf(const char *subtopic, int qos, int retain, const char *format, ...)
{
    char payload_string[64];
    int msg_id;
    va_list argptr;
    int ret;
    va_start(argptr, format);
    ret = vsnprintf(payload_string, sizeof(payload_string), format, argptr);
    va_end(argptr);
    if (ret < 0 || ret >= sizeof(payload_string)) {
        ESP_LOGW(TAG, "homie_publishf(): too long");
        goto fail;
    }
    msg_id = homie_publish(subtopic, qos, retain, payload_string);
    if (msg_id < 0) {
        ESP_LOGE(TAG, "homie_publish() failed");
        goto fail;
    }
    return msg_id;
fail:
    return -1;
}

int homie_publish_int(const char *subtopic, int qos, int retain, int payload)
{
    char payload_string[16];
    int msd_id;
    int ret;
    ret = snprintf(payload_string, sizeof(payload_string), "%d", payload);
    if (ret < 0 || ret >= sizeof(payload_string)) {
        ESP_LOGE(TAG, "homie_publish_int(): payload is too long");
        goto fail;
    }
    msd_id = homie_publish(subtopic, qos, retain, payload_string);
    if (msd_id < 0) {
        ESP_LOGE(TAG, "homie_publish_int(): homie_publish() failed");
        goto fail;
    }
    return msd_id;
fail:
    return -1;
}

int homie_publish_bool(const char *subtopic, int qos, int retain, bool payload)
{
    return homie_publish(subtopic, qos, retain, payload ? "true" : "false");
}

static int _clamp(int n, int lower, int upper)
{
    return n <= lower ? lower : n >= upper ? upper : n;
}

static int8_t _get_wifi_rssi()
{
    wifi_ap_record_t info;
    if (esp_wifi_sta_get_ap_info(&info) != ESP_OK)
    {
        ESP_LOGW(TAG, "esp_wifi_sta_get_ap_info() failed");
        return 0;
    }
    else
    {
        return info.rssi;
    }
}

static esp_err_t _get_ip(char *ip_string, size_t len)
{
    int ret;
    tcpip_adapter_ip_info_t ip;
    tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &ip);

    ret = snprintf(
        ip_string,
        len,
        "%u.%u.%u.%u",
        (ip.ip.addr & 0x000000ff),
        (ip.ip.addr & 0x0000ff00) >> 8,
        (ip.ip.addr & 0x00ff0000) >> 16,
        (ip.ip.addr & 0xff000000) >> 24);
    if (ret < 0 || ret >= len) {
        ESP_LOGE(TAG, "_get_ip(): ip_string too short");
        goto fail;
    }
    return ESP_OK;
fail:
    return ESP_FAIL;
}

static esp_err_t _get_mac(char *mac_string, size_t len, bool sep)
{
    // NB: This is the base mac of the device. The actual wifi and eth MAC addresses
    //     will be assigned as offsets from this.

