craftmetrics/esp32-homie/homie.c
    /* when QoS is 1, msg_id must be positive integer */
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$homie", QOS_1, RETAINED, "2.0.1"));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$online", QOS_1, RETAINED, "true"));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$name", QOS_1, RETAINED, config->device_name));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$localip", QOS_1, RETAINED, ip_address));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$mac", QOS_1, RETAINED, mac_address));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$fw/name", QOS_1, RETAINED, config->firmware_name));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$fw/version", QOS_1, RETAINED, config->firmware_version));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$nodes", QOS_1, RETAINED, "")); // FIXME: needs to be extendible
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$implementation", QOS_1, RETAINED, "esp32-idf"));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$implementation/version", QOS_1, RETAINED, "dev"));

    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$stats", QOS_1, RETAINED, "uptime,rssi,signal,freeheap")); // FIXME: needs to be extendible
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish("$stats/interval", QOS_1, RETAINED, "30"));
    FAIL_IF_LESS_THAN_OR_EQUAL_ZERO(homie_publish_bool("$implementation/ota/enabled", QOS_1, RETAINED, config->ota_enabled));

    const esp_partition_t *running_partition = esp_ota_get_running_partition();
    if (running_partition != NULL)
    {
        msg_id = homie_publishf("$implementation/ota/running",
                                QOS_1, RETAINED, "0x%08x", running_partition->address);
        if (msg_id < 0) {
            ESP_LOGE(TAG, "homie_connected(): homie_publishf() failed");
            goto fail;
        }
    }
    else
    {
        msg_id = homie_publishf("$implementation/ota/running",
                                QOS_1, RETAINED, "NULL");
        if (msg_id < 0) {
            ESP_LOGE(TAG, "homie_connected(): homie_publishf() failed");
            goto fail;
        }
    }

    const esp_partition_t *boot_partition = esp_ota_get_boot_partition();
    if (boot_partition != NULL)
    {
        msg_id = homie_publishf("$implementation/ota/boot",
                                QOS_1, RETAINED, "0x%08x", boot_partition->address);
        if (msg_id < 0) {
            ESP_LOGE(TAG, "homie_connected(): homie_publishf() failed");
            goto fail;
        }
    }
    else
    {
        msg_id = homie_publishf("$implementation/ota/boot",
                                QOS_1, RETAINED, "NULL");
        if (msg_id < 0) {
            ESP_LOGE(TAG, "homie_connected(): homie_publishf() failed");
            goto fail;
        }
    }

    homie_subscribe("$implementation/reboot");
    homie_subscribe("$implementation/logging");
    if (config->ota_enabled)
        homie_subscribe("$implementation/ota/url/#");
#endif
    if (config->init_handler != NULL) {
        config->init_handler();
    }
    xEventGroupClearBits(*mqtt_group, HOMIE_MQTT_STATUS_UPDATE_REQUIRED);
    ESP_LOGI(TAG, "device status has been updated");
    return ESP_OK;
fail:
    return ESP_FAIL;
}

/**
 * @brief Create MQTT topic path to an attribute
 *
 * @param[out] buf String buffer to keep the path
 * @param[in] len Size of buf
 * @param[in] node Node name (ignored if the Homie version does not support it)
 * @param[in] attr Attribute name
 * @return -1 on error, The number of characters printed (see snprintf(3)).
 */
static int topic_path_to_node_attribute(char *buf, const size_t len, const char *node, const char *attr)
{
    int ret;
#if defined(CONFIG_HOMIE_VERSION_4_0_0)

    /* homie/24ac45ac44/esp/freeheap -> value */
    char format[] = "%s/%s";
    ret = snprintf(buf, len, format, node, attr);
#elif defined(CONFIG_HOMIE_VERSION_2_0_1)

    /* homie/24ac45ac44/$stats/freeheap -> value */
    char format[] = "$stats/%s";
    ret = snprintf(buf, len, format, attr);
#endif
    if (ret < 0 || ret >= len) {
        ESP_LOGE(TAG, "topic_path_to_node_attribute(): buf is too small");
        goto fail;
    }
    return ret;
fail:
    return -1;
}

static void homie_task(void *pvParameter)
{
    int msg_id;
    int rssi;
    char buf[32 + 1];

    while (1)
    {
        rssi = _get_wifi_rssi();
        if ((xEventGroupGetBits(*mqtt_group) & HOMIE_MQTT_STATUS_UPDATE_REQUIRED) > 0) {
            if (homie_connected() != ESP_OK) {
                ESP_LOGW(TAG, "homie_task(): homie_connected() failed");
            }
        }

        if (topic_path_to_node_attribute(buf, sizeof(buf), homie_node_name, "uptime") < 0) {
            ESP_LOGW(TAG, "homie_task(): topic_path_to_node_attribute() failed: uptime");
        } else {
            msg_id = homie_publish_int(buf, QOS_1, RETAINED, esp_timer_get_time() / 1000000);
            if (msg_id < 0) {
                ESP_LOGW(TAG, "homie_task(): failed to publish uptime");
            }
        }

        if (topic_path_to_node_attribute(buf, sizeof(buf), homie_node_name, "rssi") < 0) {
            ESP_LOGW(TAG, "homie_task(): topic_path_to_node_attribute() failed: rssi");
        } else {
            msg_id = homie_publish_int(buf, QOS_1, RETAINED, rssi);
            if (msg_id < 0) {
                ESP_LOGW(TAG, "homie_task(): failed to publish rssi");
            }
        }

        if (topic_path_to_node_attribute(buf, sizeof(buf), homie_node_name, "signal") < 0) {
            ESP_LOGW(TAG, "homie_task(): topic_path_to_node_attribute() failed: signal");
        } else {

            /* Translate to "signal" percentage, assuming RSSI range of
             * (-100,-50)
             */
            msg_id = homie_publish_int(buf, QOS_1, RETAINED, _clamp((rssi + 100) * 2, 0, 100));
            if (msg_id < 0) {
                ESP_LOGW(TAG, "homie_task(): failed to publish signal");
            }
        }

        if (topic_path_to_node_attribute(buf, sizeof(buf), homie_node_name, "freeheap") < 0) {
            ESP_LOGW(TAG, "homie_task(): topic_path_to_node_attribute() failed: freeheap");
        } else {
            msg_id = homie_publish_int(buf, QOS_1, RETAINED, esp_get_free_heap_size());
            if (msg_id < 0) {
                ESP_LOGW(TAG, "homie_task(): failed to publish freeheap");
            }
        }
        vTaskDelay(30000 / portTICK_PERIOD_MS);
    }
}

esp_mqtt_client_handle_t homie_init(homie_config_t *passed_config)
{
    config = passed_config;
    mqtt_group = config->event_group;
    if (!config) {
        ESP_LOGE(TAG, "invalid argument");
        goto fail;
    }
    if (!config->event_group) {
        ESP_LOGE(TAG, "invalid argument: event_group");
        goto fail;
    }

    // If client_id is blank, generate one based off the mac
    if (!config->client_id[0])
        _get_mac(config->client_id, HOMIE_MAX_CLIENT_ID_LEN, false);

    if ((client = mqtt_app_start()) == NULL) {
        ESP_LOGE(TAG, "mqtt_app_start(): failed");
        goto fail;
    }
    if (xTaskCreate(&homie_task, "homie_task", configMINIMAL_STACK_SIZE * 10, NULL, 5, NULL) != pdPASS) {
        ESP_LOGE(TAG, "xTaskCreate() failed");
        goto fail;
    }
    return client;
fail:
    return NULL;
}
